test/folder1/emacsconf_2022_talks_emacs_journalism_or_everything_s_a_nail_if_you_hit_it_with_emacs.txt
           ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
            EMACSCONF - 2022 - TALKS - EMACS JOURNALISM (OR
             EVERYTHING’S A NAIL IF YOU HIT IT WITH EMACS)

                              Chahak Mehta
           ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━


Table of Contents
─────────────────




Reference URL: <https://emacsconf.org/2022/talks/journalism/>

• Short talk by Alfred Zanini, a journalist and documentary filmmaker
  based in Hong Kong.
• Talk about workflows
• What is a workflow?
  ⁃ Any sequnce of actions or tools to achieve a broader task.
• Good way to start improving workflows is to actually make a conscious
  effort to figure out /what/ are my regular workflows and write those
  down.
• Maybe creating a flowchart will make it easier to understand what all
  things are required in a workflow.
• If literate programming using org is a serious thought, then I need to
  study up and use the /noweb syntax/ properly as it allows me to not
  have to follow the same structure that my tangled code file would
  have.
• Don’t do everything all at once. Change one part of your workflow and
  get comfortable with that change before changing something else.
